label big_scene_for_blue_violet_and_salat_way:
    scene bg ggroom_dark
    show gg calm1
    with fade

    "После четырёх изнурительных дней работы над игрой ты понимаешь, что до завершения проекта остался всего один день."
    "Ты решаешь провести интенсивную финальную сессию, чтобы довести игру до минимально приемлемого уровня качества и избежать катастрофических багов, которые могут сорвать презентацию игры работодателю."
    
    "Шаг 1: Подготовка к рефакторингу"

    show gg think_
    "Рефакторинг... ты гуглишь, что это такое и как его делать."
    "{b}Рефакторинг{/b} — это процесс изменения внутренней структуры программы, не затрагивающий её внешнего поведения и имеющий целью облегчить понимание её работы."
    "Ты понимаешь, что твой код сейчас — это скопление хаотичных решений, принятых в спешке."
    
    show gg calm2
    "Никто сразу и не поймёт, что ты тут понаписал. Поэтому, прежде чем делать что-то серьёзное, ты начинаешь с ревизии основных компонентов: открываешь ключевые файлы с кодом и на листочке помечаешь самые хаотичные участки."
    "Ты знаешь, что полный рефакторинг невозможен, но хочешь сделать код хотя бы немного чище."
    
    show gg think_
    "Шаг 2: Минимизация хаоса в коде"
    "Ты начинаешь с самых проблемных функций — тех, которые отвечают за передвижение игрока и коллизию с объектами уровня." 
    "Слишком много «магических чисел»(плохая практика программирования, когда в исходном коде встречается числовое значение и неочевиден его смысл), вложенных условий и временных переменных, которые запутывают логику." 
    "Ты терпеливо заменяешь «магические числа» на осмысленные константы, переименовываешь переменные на более говорящие названия, комментируешь сложные части, где это нужно."
    "В процессе ты находишь два дублирующихся куска кода, которые управляли анимацией персонажа, и выносишь их в отдельную функцию. Это не только упрощает код, но и даёт шанс избежать досадных ошибок при добавлении новых уровней."
    
    show gg calm1
    "Шаг 3: Исправление критических багов"
    "Переключившись на исправление багов, ты сосредотачиваешься на главных проблемах, которые могут убить всё впечатление от игры:"
    "Баг с падением сквозь платформы: он замечаешь, что при прыжке персонаж иногда проваливается сквозь платформу, если нажать клавишу слишком быстро." 
    "Он добавляет небольшой таймер, чтобы обработка коллизии происходила с небольшой задержкой, предотвращая такие ситуации."

    "Шаг 4: Финализация уровней"
    "Убедившись, что критические баги исправлены, ты переходишь к завершению дизайна уровней."

    "Ты понимаешь, что у тебя нет времени создавать новые элементы, поэтому сосредотачиваешься на «полировке» уже существующих"
    "Добавляешь несколько сложных платформ в последний уровень, чтобы игроку было интересно проходить его."
    "Прячешь несколько бонусов для тех, кто исследует уровни вдумчиво."
    "Ты понимаешь, что идеала тебе уже не достичь, но ты стараешься, чтобы игровой процесс выглядел цельным и доставлял удовольствие."
    "Всё."
    "Игра готова."
    "Облегчение."
    "Спокойствие."
    "Гора с плеч."
    "Засыпай... Спокойной ночи."

    jump end_day_4


label big_scene_for_green_way:
    scene bg ggroom_dark
    show gg calm1
    with fade
    "После четырёх изнурительных дней работы над игрой ты понимаешь, что до завершения проекта остался всего один день."
    "Ты решаешь провести интенсивную финальную сессию, чтобы довести игру до минимально приемлемого уровня качества и избежать катастрофических багов, которые могут сорвать презентацию игры работодателю."
    
    "Шаг 1: Подготовка к рефакторингу"

    show gg think_
    "Рефакторинг... ты гуглишь, что это такое и как его делать."
    "{b}Рефакторинг{/b} — это процесс изменения внутренней структуры программы, не затрагивающий её внешнего поведения и имеющий целью облегчить понимание её работы."
    "Ты понимаешь, что твой код сейчас — это скопление хаотичных решений, принятых в спешке."
    "Никто сразу и не поймёт, что ты тут понаписал. Поэтому, прежде чем делать что-то серьёзное, ты начинаешь с ревизии основных компонентов: открываешь ключевые файлы с кодом и на листочке помечаешь самые хаотичные участки."
    
    show gg calm2


    "Ты знаешь, что полный рефакторинг невозможен, но хочешь сделать код хотя бы немного чище."

    "Шаг 2: \"Полировка\" игры."
    "Ты не в восторге от своей игры, потому что она выглядит совсем не так, как ты её видел в своём сне." 

    show gg calm1
    "Поэтому ты решаешь хоть немного улучшить игровой процесс, хотя сделать его просто хотя бы хорошим вряд ли представляется возможным."
    "Ты не в восторге от своей игры, потому что она выглядит совсем не так, как ты её видел в своём сне. Поэтому ты решаешь хоть немного улучшить игровой процесс, хотя сделать его просто хотя бы хорошим вряд ли представляется возможным."
    "Ты немного улучшаешь стрельбу, следуя туториалам из интернета."
    "Тебе нужно какое-то разнообразие, иначе игра выйдет совсем скучной."
    "Ты добавляешь частоту появления врагов и небольшие улучшения, по типу скорости стрельбы и увеличение скорости."

    "Ты понимаешь, что у тебя нет времени создавать новые элементы, поэтому сосредотачиваешься на «полировке» уже существующих"

    show gg think_
    "Добавляешь несколько сложных платформ в последний уровень, чтобы игроку было интересно проходить его."
    "Прячешь несколько бонусов для тех, кто исследует уровни вдумчиво."

    show gg calm1
    "Ты понимаешь, что идеала тебе уже не достичь, но ты стараешься, чтобы игровой процесс выглядел цельным и доставлял удовольствие."
    "Всё."
    "Игра готова."
    "Облегчение."
    "Спокойствие."
    "Гора с плеч."
    "Засыпай... Спокойной ночи."
    jump end_day_4

label big_scene_for_yellow_way:
    scene bg ggroom_dark
    show gg calm1
    with fade
    "После четырёх изнурительных дней работы над игрой ты понимаешь, что до завершения проекта остался всего один день."
    "Ты решаешь провести интенсивную финальную сессию, чтобы довести игру до минимально приемлемого уровня качества и избежать катастрофических багов, которые могут сорвать презентацию игры работодателю."
    
    "Шаг 1: Подготовка к рефакторингу"

    show gg think_
    "Рефакторинг... ты гуглишь, что это такое и как его делать."
    "{b}Рефакторинг{/b} — это процесс изменения внутренней структуры программы, не затрагивающий её внешнего поведения и имеющий целью облегчить понимание её работы."
    "Ты понимаешь, что твой код сейчас — это скопление хаотичных решений, принятых в спешке."
    "Никто сразу и не поймёт, что ты тут понаписал. Поэтому, прежде чем делать что-то серьёзное, ты начинаешь с ревизии основных компонентов: открываешь ключевые файлы с кодом и на листочке помечаешь самые хаотичные участки."
    "Ты знаешь, что полный рефакторинг невозможен, но хочешь сделать код хотя бы немного чище."

    show gg calm1
    "Шаг 2: Минимизация хаоса в коде"
    "Ты начинаешь с самых проблемных функций — тех, которые отвечают за передвижение игрока и коллизию с объектами уровня." 
    "Слишком много «магических чисел»(плохая практика программирования, когда в исходном коде встречается числовое значение и неочевиден его смысл), вложенных условий и временных переменных, которые запутывают логику." 
    "Ты терпеливо заменяешь «магические числа» на осмысленные константы, переименовываешь переменные на более говорящие названия, комментируешь сложные части, где это нужно."
    "В процессе ты находишь два дублирующихся куска кода, которые управляли анимацией персонажа, и выносишь их в отдельную функцию. Это не только упрощает код, но и даёт шанс избежать досадных ошибок при добавлении новых уровней."

    "Шаг 3: Исправление критических багов"
    "Переключившись на исправление багов, ты сосредотачиваешься на главных проблемах, которые могут убить всё впечатление от игры:"

    show gg calm2
    "Баг с падением сквозь платформы: он замечаешь, что при прыжке персонаж иногда проваливается сквозь платформу, если нажать клавишу слишком быстро." 
    "Он добавляет небольшой таймер, чтобы обработка коллизии происходила с небольшой задержкой, предотвращая такие ситуации."

    show gg think_
    "Шаг 4: Финализация уровней"
    "Убедившись, что критические баги исправлены, ты переходишь к завершению дизайна уровней."

    "Добавляешь возможность расширить свою игровую кафешку, чтобы приходило больше посетителей."
    "Добавляешь систему найма работников, чтобы автоматизировать работу внутриигровой межпланетной кафешки."

    show gg calm1
    "Ты понимаешь, что у тебя нет времени создавать новые элементы, поэтому сосредотачиваешься на «полировке» уже существующих"
    "Добавляешь несколько сложных платформ в последний уровень, чтобы игроку было интересно проходить его."
    "Прячешь несколько бонусов для тех, кто исследует уровни вдумчиво."
    "Ты понимаешь, что идеала тебе уже не достичь, но ты стараешься, чтобы игровой процесс выглядел цельным и доставлял удовольствие."
    "Всё."
    "Игра готова."
    "Облегчение."
    "Спокойствие."
    "Гора с плеч."
    "Засыпай... Спокойной ночи."
    jump end_day_4


label big_scene_almost_last_1:
    scene bg ggroom_bright
    show gg calm1
    with fade
    
    "Наступает последний день — день, когда ты сдашь свой проект работодателю."

    "После долгих четырёх дней без полноценного отдыха ты просыпаешься с ощущением лёгкой тревоги и воодушевления." 
    "В комнате тихо, свет пробивается сквозь шторы, напоминая, что время идёт."
    "Сегодня всё решится."

    show gg think_
    "Что мы имеем на данный момент?"

    if game_choice == "blue":
        scene bg fantasy with fade
        "Пиксельный платформер, сделанный на движке Unreal Engine."
        "Все спрайты игры были взяты из интернета. Они представляют собой какую-то солянку рисунков в жанре фэнтези, но выглядит прикольно."
        "Персонаж умеет делать двойной прыжок и стрелять энергетическими шарами во врагов."
        "В платформере всего три простеньких уровня, украденных из другой игры..."
        
        maincharacter "М-да... Не идеал конечно, но тоже ничего."
        maincharacter "Я реализовал не совсем то, что хотел, я задумывал динамичную, в которой были бы боссы, сложные уровни, много механик."
        maincharacter "Хотя сделать такую хорошую игру за такое короткое время практически невозможно."
        maincharacter "Я думаю я хорошо справился со своей задачей, меня затормозил лишь этот движок, на котором сложно даже реализовать простой пиксельный платформер..."

    elif game_choice == "violet":
        scene bg postapoc with fade
        "Пиксельный платформер. Весь дизайн игры был взят из интернета, он выполнен в жанре постапокалипсиса в тёмных тонах."
        "В игре имеются такие механики, как двойной прыжок, прыжки от стен и переключение между мирами, чтобы определённые объекты существовали лишь в определённом мире."
        "Также присутствуют враги. В платформере несколько хороших уровней, отлично демонстрирующих каждую из механик."

        maincharacter "М-да... Не идеал конечно, но тоже ничего."
        maincharacter "Я реализовал не совсем то, что хотел, я задумывал динамичную, в которой были бы боссы, сложные уровни, много механик."
        maincharacter "Хотя сделать такую хорошую игру за такое короткое время практически невозможно, я думаю я хорошо справился со своей задачей"

    elif game_choice == "salat":
        scene bg postapoc handdrawed with fade
        "Пиксельный платформер. Весь дизайн игры, который ты нарисовал сам, выполнен в стиле постапокалипсиса в тёмных тонах."
        "В игре имеются такие механики, как двойной прыжок, прыжки от стен и рывок вперёд. Также присутствуют враги."
        "В платформере несколько уровней, однако иногда они почему-то не работают."
        "Да и механики тоже выполнены немного криво: двойной прыжок иногда не срабатывает, во время прыжков от стен персонаж может застрять в стене."
        
        maincharacter "М-да... Не идеал конечно, но тоже ничего."
        maincharacter "Геймплей смотрится немного уныло, не так, как я представлял, не хватает каких-то эффектов, взаимодействия с окружением, умных врагов..."
        maincharacter "Мультиплеер бы смотрелся тут шикарно..."
        maincharacter "Хотя сделать такую хорошую игру за такое короткое время практически невозможно, я думаю я хорошо справился со своей задачей."

    elif game_choice == "yellow":   
        scene bg spacecafe with fade
        "Симулятор управления межпланетным кафе!"
        "Приходят инопланетные клиенты, заказывают какое-то блюдо(иногда очень специфичное), ты должен достать нужные ингридиенты, приготовить блюдо, отдать клиенту."
        "Чем быстрее сделано блюдо, тем больше денег получаешь, при условии что блюдо сделано по рецепту правильно. Ты можешь улучшать кафе и нанимать персонал."
        
        maincharacter "Мне нравится что я сделал, но в планах у меня ещё куча нереализованных идей, например, механика загрязнения, вследствие чего будут появляться инопланетные крысы."
        maincharacter "Хотя сделать такую хорошую игру за такое короткое время практически невозможно, я думаю я отлично справился со своей задачей.Надеюсь, им понравится то, что я придумал."

    elif game_choice == "green":
        scene bg shooter

        "Какой-то недошутер."
        "Есть арена, тупенький ИИ противников, есть персонаж в большом роботе, который со временем ломается, и тебе нужно его менять(можно захватить вражеский), есть стрельба. Ты пытался добавить что-то ещё, но оно не работает." 
        
        maincharacter "М-да... Не идеал конечно, но тоже ничего."
        maincharacter "Хотя сделать такую хорошую игру за такое короткое время практически невозможно, я думаю я неплохо справился со своей задачей."
        maincharacter "Тем более, главное - концепт. Надеюсь, им понравится то, что я придумал."

    scene bg ggroom_bright
    show gg think_
    with dissolve
    maincharacter "Ну, думаю, пора идти. Через час мне нужно быть в офисе, где будут на месте оценивать мою игру."

    "Ты одеваешься свою парадную одежду, чтобы показать себя с лучшей стороны и отправляешься в путь."

    scene bg street with dissolve
    
    "Ты направляешься в..."
    "{cps=7}{sc=10}{b=40}{color=#ff0000}ТЁМНЫЙ И ЗЛОВЕЩИЙ МОРДОР{/color}{/b}{/sc}{/cps}{cps=1}{/cps}, ну или же тёплый и уютный офис."

    jump going_to_OFFIC_лучшая_карта_кс_имхо


label going_to_OFFIC_лучшая_карта_кс_имхо:
    show gg calm1 with moveinright

    "Ты идёшь к офису, чувствуя, как утренний воздух бодрит и слегка охлаждает лицо."
    "Ты не спешишь, позволяя себе прочувствовать каждое мгновение. Шаги размеренные, почти торжественные." 
    "Прошедшая ночь отдыха наполнила тебя новыми силами, и в груди приятно волнуется — это не страх, а скорее ожидание, предвкушение того, что вот-вот случится что-то важное."
    "Ты подходишь к высокому зданию офиса, останавливаешься, собираешься с мыслями и уверенно идёшь дальше."

    show gg calm1 with moveinright:
        xalign -0.23
        yalign 1.05
        
    pause 1.0

    scene bg officecuredor  with fade
    pause 0.5
    show gg calm1 with dissolve

    play music spooki_skary_coridor fadeout 2.0
    "Проходя через холл, ты чувствуешь, как нарастает тихое волнение." 
    "Лёгкое сердцебиение, как отбивающий ритм барабан, сопровождает тебя, пока ты идёшь по коридорам."
    "Здание тихое, деловое, и каждый шаг гулко отзывается под высокими потолками. В руках ты крепко сжимаешь флешку с игрой, почти ощущая её вес — результат четырёхдневного труда, твоя надежда на работу мечты."
    "Наконец ты доходишь до комнаты совещаний и на мгновение задерживаешься перед дверью." 
    "За дверью — твоё будущее и, возможно, твой шанс. Ещё раз глубоко вдохнув, ты открываешь дверь и заходишь внутрь."
    stop music fadeout 1.0
    
    scene bg bossoffice with fade
    show boss calm with dissolve:
        xalign 0.3
        yalign 1.05
        
    pause 0.5

    show gg calm1 with moveinright:
        xalign 0.8
        yalign 1.05
    "В комнате царит тишина. За длинным столом в костюме сидит всего один человек." 
    "Его взгляд  серьёзен, устремлён на тебя с профессиональными интересом."
    "Судя по всему, ОН твой Босс." 
    "Он кивает в знак приветствия, и ты здороваешься, слегка кивнув в ответ."
    "Ты ощущаешь, что это момент, в котором всё решится."

    if game_choice == "blue":
        jump blue_scene_END_IS_NEAR
    elif game_choice == "violet":
        jump violet_scene_END_IS_NEAR
    elif game_choice == "salat":
        jump salat_scene_END_IS_NEAR
    elif game_choice == "yellow":
        jump yellow_scene_END_IS_NEAR
    elif game_choice == "green":
        jump green_scene_END_IS_NEAR

 
