label green_scene_1:
    "Очередной день. Кажется, ты уже начинаешь уставать, хотя игра совсем не готова."
    "На данный момент у тебя есть управление персонажем, взаимодействие с объектами и плохо реализованная стрельба стрельба."
    "И вот ты решил сделать себе небольшой отдых, вкусно пообедать, и тут..."
    jump big_scene_2

label green_scene_2:
    maincharacter "Без паники! Нужны лишь пара механик, модельки объектов, арена и враги!"
    maincharacter "Ох, не так уж и мало на самом деле... Не будет мне никакого отдыха в эти 2 дня! За работу!!"
    maincharacter "-Найду модельки в интернете, чёрт с ними!"
    maincharacter "-Нужны роботы с пушками, в которых может сидеть игрок, а также окружение... пусть будет простая арена, которая сделана из простейших фигур."

    "Отлично! Пару десятков минут поиска в открытых источниках и подходящие модели есть! Ты подобрал модельки с текстурами, которые подходят твоей игре."
    "Ты начинаешь программировать механику смены робота, здоровье, урон."
    "Однако управляемые роботы будут без анимаций, потому что это оказалось слишком сложным. Всё это без сюжета, ведь на это просто нет времени."
    "Эту ночь ты практически не спишь... До четырёх часов ночи ты программируешь и программируешь, и у тебя..."
    "...Кажется, получилось! Ты сделал всё что хотел, но не без багов. В твоей игре нет только анимаций и врагов. Ты засыпаешь прямо на столе перед ноутбуком."
    jump end_day_3

label green_scene_3:
    maincharacter "Я работаю над 3D-шутером с роботами, но некоторые вещи всё еще не успел реализовать."
    maincharacter "Если честно, мне бы очень пригодилась помощь с финальными доработками — багами и оптимизацией."

    show pavel calm1:
        xalign 0.8
        yalign 1.05
    "Ты даёшь ему сыграть в твой прототип игры."
    show gg calm1:
        xalign 0.2
        yalign 1.05

    pavel "М-да... Сыровата игра, слишком сложный концепт ты выбрал для быстрой одиночной разработки."
    pavel "Вот и первый баг. Если слишком часто нажимать кнопку стрельбы, то возможность стрелять ломается. Сейчас исправим!"

    "Он молниеносно находит эту механику в коде и исправляет её, а ты даже не успеваешь уследить за его действиями"
    jump big_scene_4


label green_scene_END_IS_NEAR:
    show boss hands_:
        xalign 0.3
        yalign 1.05
    boss "Итак, [gg_name]. Я ждал вас."
    boss "Не будем тянуть. Начнём."

    "Твоя ладонь крепче сжимает флешку, и ты быстро подходишь к компьютеру, подключаешь её к порту." 
    "Ты включаешь игру, и на экране появляется главное меню — результат дней и ночей работы, испытание для твоих навыков и терпения."
    "Открывается первый уровень, и ты слышишь..."

    boss "Прошу, сначала расскажите про вашу игру. Что она из себя представляет?"

    show gg calm2:
        xalign 0.8
        yalign 1.05
    maincharacter "Это... 3D-шутер. Есть арена,  несложный ИИ противников, есть персонаж в большом роботе, который со временем ломается, и тебе нужно его менять. есть стрельба. Ну, так я это задумывал."

    boss "Что делает твою игру особенной?"
    show gg speak_:
        xalign 0.8
        yalign 1.05
    maincharacter "Это должен был быть амбициозный динамичный шутер с большими роботами. Эта задумка как по-мне очень уникальна."
    maincharacter "Я подразумевал сделать мультиплеер, но не успел."
    
    show boss speak_:
        xalign 0.3
        yalign 1.05
    boss "Интересный концепт, честно говоря странно, что подобного я ещё не видел."
    boss "Ну, посмотрим, как ты всё это реализовал. Продемонстрируй... что там у тебя? Уровень? Арена?."
    
    show boss calm:
        xalign 0.3
        yalign 1.05
    "Ты нажимаешь кнопку \"ИГРАТЬ\" в главном меню." 
    "Ты появляешься в серой арене на роботе. Напротив тебя прямо на глазах появляется противник из воздуха."
    "Он стоит неподвижно и изредко стреляет по тебе."
    "Ты уничтожаешь его, и из вражеского робота выпадает улучшение для скорости."
    "Появляется следующий противник. Ты выходишь из своего робота и успешно захватываешь вражеский, запрыгнув на него."
    "Босс, кажется, не впечатлён."

    show boss speak_:
        xalign 0.3
        yalign 1.05
    boss "Понятно... Теперь позволь мне сыграть..."

    show gg calm2:
        xalign 0.8
        yalign 1.05
    maincharacter "Да, конечно... прошу."
    
    show boss calm:
        xalign 0.3
        yalign 1.05
    "Ты передаешь клавиатуру и мышь Боссу"
    "Он проверяет управление, стрельбу, урон, пытается умереть от врагов."
    "Оказывается, проиграть в этой игре не так уж и просто."
    "Далее он вылезает из робота и бегает по карте, пока по нему стреляют враги."
    "Выглядит всё это не очень динамично."


    boss "Довольно..."
    boss "Это всё даже не выглядит, как полноценная игра."
    boss "Оно выглядит, как просто чья-то сырая тестовая зона. Даже арена серая, без текстур."
    boss "Так, ладно. Баги. Расскажи, как ты с ними справлялся?"


    maincharacter "Когда я сделал первую версию игры, у меня было довольно много багов, таких как неработающая стрельба, сломанная физика."
    maincharacter "Критические баги мне помог пофиксить ваш сотрудник, Павел. Некоторую часть я исправил после встречи с ним, после того, как я научился правильно находить и фиксить баги."
    maincharacter "Часть багов также отпала, когда я делал рефакторинг кода. На исправление оставшихся багов просто не хватило времени..."
    show boss hands:
        xalign 0.3
        yalign 1.05
    boss "Оу, так ты уже и с сотрудниками познакомился? И даже поработать с ними успел? Это, несомненно, большой плюс."
    show gg calm1:
        xalign 0.8
        yalign 1.05
    maincharacter "Да, ваши сотрудники довольно отзывчивы, и не только Павел. Они мне помогли в разработке игры."

    boss "Да, именно таких мы и берём в нашу команду."

    maincharacter "А теперь скажи-ка мне честно, мы дали тебе на разработку игры полгода, сколько из этого времени вы потратили на свою игру, что тебе не хватило времени, чтобы довести игру до ума?"

    menu:
        "4 Дня. (сказать правду)":
            jump green_end
        "Ну... где-то месяц (солгать)":
            jump swamp_end_Pu_pu_pu

label green_end:
    show gg calm2:
        xalign 0.8
        yalign 1.05
    maincharacter "Я начал разработку 4 дня назад, когда пришло ваше письмо... "
    maincharacter "Я так увлёкся видеоиграми и развлечениями, что забыл о дедлайне..."

    boss "Это всё объясняет..."

    show boss speak_:
        xalign 0.3
        yalign 1.05
    boss "Это было глупо с твоей стороны так относиться к дедлайну. Если ты умудрился реализовать это за 4 дня, то представь, что ты сделал бы за несколько месяцев!"

    "Он проверяет дату изменения файлов и убеждается, что ты говоришь правду"

    show boss hands_:
        xalign 0.3
        yalign 1.05
    boss "Удивительно..."
    boss "Что касается самой игры..."
    boss "Это совершенно нормально! Всего 4 дня разработки, полной реализации такой амбициозной игры невозможно добиться в такой короткий срок, это полностью оправдано."
    boss "Уверен, будь у тебя больше времени, ты бы несомненно справился, ведь так?"

    show gg calm1:
        xalign 0.8
        yalign 1.05
    maincharacter "Так точно, сэр!"

    boss "Я и не сомневался."
    boss "Правда, ты взял на себя слишком многое. Ты знал, что у тебя мало времени, но ты всё же решился начать реализовывать эту чересчур трудоёмкую игру."
    boss "Я готов сделать вердикт."

    maincharacter "Правда? Вот так сразу?"

    boss "Конечно, зачем тянуть?"

    maincharacter "Я вас слушаю..."

    "Твоё сердце начинает биться сильнее и сильнее, как будто оно сейчас вырвется из твоей груди, сядет в управляемого робота и начнёт крушить всё вокруг."
    
    show boss calm:
        xalign 0.3
        yalign 1.05
    boss "Учитывая, что вы безответственно отнеслись к дедлайну, и потратили всего четыре дня из шести месяцев..."
    boss "При этом сделав очень сырую, но амбициозную по задумке игру в кратчайшие сроки..."
    boss "Я принимаю решение..."
    boss "Я готов принять вас на стажировку геймдизайнером, а дальше уже посмотрим, брать вас или нет."
    boss "Посмотрим, как твои амбициозные идеи могут помочь компании."
    boss "Ну, [gg_name], что скажете?"

    show gg shock_:
        xalign 0.8
        yalign 1.05
    maincharacter "Да! Да, чёрт возьми!"
    maincharacter "Попасть к вам - вот моя мечта. И она сбывается. Спасибо вам, я вас не подведу!"

    boss "Добро пожаловать в команду!"
    jump green_epilog

label green_epilog:

    scene bg yay with fade
    "И вот ты официально стал частью команды, и теперь ты работаешь вместе с теми, кто тебе помогал и продолжает помогать до сих пор."
    "Сева, Павел, Настя, Костян - все рады видеть тебя в дружном коллективе."
    "Тебя назначили работать вместе с Костяном над механиками мультиплеерной игры, которую разрабатывала Компания. Ты предлагаешь свои идеи, пытаешься их реализовать."
    "Ты явно добиваешься успеха в этой команде, после месячной стажировки Босс решает повысить тебя до штатного геймдизайнера."
    "После этого, Босс даёт тебе возможность реализовать твою задумку с 3D-шутером с роботами. Вы работаете над ней полноценной командой, используя твои наработки, которые ты сделал за те 4 дня."
    "Спустя два года интенсивной работы, разработка наконец завершена. Игра в релизе. Она получает миллионы скачиваний, приносит мировую славу Компании и становится её самой известной игрой."
    "Твоя мечта сбылась - ты наконец создаёшь в команде масштабную игру, которая действительно нравится людям по всему миру."
    "И вот так заканчивается, или же только начинается история одного амбициозного геймдизайнера..."
    jump credits

label swamp_end_Pu_pu_pu:
    show gg calm2:
        xalign 0.8
        yalign 1.05
    maincharacter "Я понимаю, что она ещё не идеальна… Но ведь потенциал виден, правда? Если доработать…"

    show boss calm:
        xalign 0.3
        yalign 1.05
    boss "Потенциал? Возможно. Но у нас здесь, в компании, нет времени заниматься догадками. Мы принимаем готовые проекты или хотя бы такие, которые чётко демонстрируют вашу компетенцию."

    "Пауза, он нажимает на ноутбуке клавишу, игра сворачивается"

    boss "Эта игра… Сырой геймплей, баги, текстуры проваливаются. Я не могу представить, чтобы она впечатлила кого-либо."
    show gg calm1:
        xalign 0.8
        yalign 1.05
    maincharacter "Пожалуйста, дайте мне ещё неделю. Я исправлю всё, что нужно!"
    maincharacter "Я просто хотел сделать что-то большее, показать свою амбициозность."
    maincharacter "Мне важно было удивить вас!"

    show boss hands_:
        xalign 0.3
        yalign 1.05
    boss "Амбициозность — это хорошо. Но есть разница между амбициозностью и неумением оценить свои силы."
    boss "Вы хотели создать сложный 3D-шутер с роботами за месяц. Это нереалистично. Вместо того чтобы сфокусироваться на чём-то компактном, доведённом до блеска, вы создали хаос."

    maincharacter "Я просто хотел доказать, что могу…"

    boss "Я вижу, что вы талантливый парень, и у вас есть страсть. Но страсть без планирования и дисциплины — это рецепт провала."
    boss "Это был ваш шанс показать, что вы умеете справляться с реальными задачами в определённые сроки. И вы его упустили."
    boss "Я принял решение. Мы не можем взять вас к себе, поймите. Вы свободны. До свидания."

    "Ты молча киваешь, берёшь с собой флешку, и покидаешь здание офиса."
    jump pu_pu_pu_end


label pu_pu_pu_end:
    scene bg pu_pu_pu_end with fade
    "Ты не забрасываешь разработку видеоигр, а продолжаешь учиться и делать что-то новое."
    "Проходит год самообучения и разработки разносортных инди-игр, которые ты делал в процессе обучения."
    "Со всем этим багажом ты устраиваешься в другую, менее известную компанию, где разрабатывают видеоигры, но тебе там действительно нравится: хороший коллектив, уютный офис, хорошие условия для разработки."
    "Проходит время, и ты видишь, как Компания, в которую тебя не приняли в первый раз выпускает игру под названием Mecha Strike, где полностью копируют когда-то придуманный тобой концепт."
    jump credits
