label green_scene_1:
    "Очередной день. Кажется, ты уже начинаешь уставать, хотя игра совсем не готова."
    "На данный момент у тебя есть управление персонажем, взаимодействие с объектами и плохо реализованная стрельба стрельба."
    "И вот ты решил сделать себе небольшой отдых, вкусно пообедать, и тут..."
    jump big_scene_2

label green_scene_2:
    maincharacter "Без паники! Нужны лишь пара механик, модельки объектов, арена и враги!"
    maincharacter "Ох, не так уж и мало на самом деле... Не будет мне никакого отдыха в эти 2 дня! За работу!!"
    maincharacter "-Найду модельки в интернете, чёрт с ними!"
    maincharacter "-Нужны роботы с пушками, в которых может сидеть игрок, а также окружение... пусть будет простая арена, которая сделана из простейших фигур."

    "Отлично! Пару десятков минут поиска в открытых источниках и подходящие модели есть! Ты подобрал модельки с текстурами, которые подходят твоей игре."
    "Ты начинаешь программировать механику смены робота, здоровье, урон."
    "Однако управляемые роботы будут без анимаций, потому что это оказалось слишком сложным. Всё это без сюжета, ведь на это просто нет времени."
    "Эту ночь ты практически не спишь... До четырёх часов ночи ты программируешь и программируешь, и у тебя..."
    "...Кажется, получилось! Ты сделал всё что хотел, но не без багов. В твоей игре нет только анимаций и врагов. Ты засыпаешь прямо на столе перед ноутбуком."
    jump end_day_3

label green_scene_3:
    maincharacter "Я работаю над 3D-шутером с роботами, но некоторые вещи всё еще не успел реализовать."
    maincharacter "Если честно, мне бы очень пригодилась помощь с финальными доработками — багами и оптимизацией."

    "Ты даёшь ему сыграть в твой прототип игры."

    pavel "М-да... Сыровата игра, слишком сложный концепт ты выбрал для быстрой одиночной разработки."
    pavel "Вот и первый баг. Если слишком часто нажимать кнопку стрельбы, то возможность стрелять ломается. Сейчас исправим!"

    "Он молниеносно находит эту механику в коде и исправляет её, а ты даже не успеваешь уследить за его действиями"
    jump big_scene_4

