label pink_scene_1:
    "В интернете ты находишь информацию, что для пиксельных игр лучше использовать Aseprite."
    "Ты начинаешь рисовать кучу спрайтов для локаций, персонажей и окружения."
    "Все рисунки выполнены в жанре постапокалипсиса, где всё грязное, заброшенное, в тёмных тонах."
    "Процесс рисования небыстрый, но вот ты в спешке уже нарисовал примерно половину спрайтов. Ты уже хотел было отдохнуть, но тут..."
    jump big_scene_2

label pink_scene_2:
    maincharacter "-Без паники! у меня уже почти всё готово! Нужны лишь спрайты и уровни... Не будет мне никакого отдыха в эти 2 дня! За работу!!"
    maincharacter "Ты начинаешь рисовать в усиленном темпе. Ты никогда так быстро не рисовал."
    maincharacter "Получается конечно, не так качественно, как хотелось бы, но главное это выглядит неплохо."

    "Прошло несколько часов рисования. Теперь ты в спешке начинаешь придумывать уровни, заимствуя их из других популярных платформеров"
    "Эту ночь ты практически не спишь... До четырёх часов ночи ты пытаешься реализовать зачастую кривые и неработающие уровни, и у тебя..."
    "..."
    "Получилось! Ты сделал это! Спрайты для игры и три странноватых уровня готовы. Ты засыпаешь прямо на столе перед ноутбуком."
    jump end_day_3

label pink_scene_3:
    maincharacter "Я работаю над платформером, но некоторые вещи всё еще не успел реализовать."
    maincharacter "Если честно, мне бы очень пригодилась помощь с финальными доработками — багами и оптимизацией."

    "Ты даёшь ему сыграть в твой прототип игры."

    pavel "Хм, ну, выглядит неплохо, давай проверим механики..."
    pavel "Ага! Если слишком часто переключаться между измерениями, то некоторые объекты в игре ломаются. Сейчас исправим!"

    "Он молниеносно находит эту механику в коде и исправляет её, а ты даже не успеваешь уследить за его действиями"
    jump big_scene_4
