label salat_scene_1:
    "Рисование очень увлекает, ты даже не заметил как прошёл целый день, и всё ещё полон сил"
    "Ты нарисовал кучу спрайтов для локаций, персонажей, окружения и способностей, которые навряд ли даже будут в игре."
    "Все рисунки выполнены в жанре постапокалипсиса, где всё грязное, заброшенное, в тёмных тонах."
    "И вот, после всей этой проделанной работы, ты решаешь немного отдохнуть, но тут..."
    jump big_scene_2

label salat_scene_2:
    maincharacter "Но ведь... У меня вообще ничего не готово кроме чёртовых рисунков!!"
    "Ты начинаешь работу в усиленном темпе. Выбираешь первый попавшийся в интернете игровой движок - Unity."
    "Ты начинаешь реализовывать двойной прыжок, подключать свои спрайты через инструмент в движке {bt=6}{color=#1cd3a2}Tilemap{/color}{/bt}, а также просто воровать"
    "нет"
    "ВДОХНОВЛЯТЬСЯ* уровнями с препятствиями из других популярных платформеров, попутно переделывая их, немного упрощая."
    "Эту ночь ты практически не спишь... До четырёх часов ночи ты программируешь и попутно исправляешь придуманные в спешке уровни, и у тебя..."
    "...Более-менее получилось! Слабоватые механики, однообразие, один иногда неработающий уровень, баги, но оно работает!"
    "Ты засыпаешь прямо на столе перед ноутбуком."
    jump end_day_3

label salat_scene_3:
    maincharacter "Я работаю над платформером, но некоторые вещи всё еще не успел реализовать."
    maincharacter "Если честно, мне бы очень пригодилась помощь с финальными доработками — багами и оптимизацией."
    
    "Ты даёшь ему сыграть в твой прототип игры."

    pavel "Хм, ну, выглядит неплохо, правда геймплей... мягко говоря хромает."
    pavel "Давай по-быстрому добавим механику рывка и прыжка по стенам - классические фичи в платформерах, много раз такое делал."

    "н молниеносно вводит механики в код, исправляет код прыжка, а ты даже не успеваешь уследить за его действиями"
    jump big_scene_4