label violet_scene_1:
    "Поиск{cps=2}...{/cps}"
    "Отлично! Пару десятков минут поиска в открытых источниках и подходящие спрайты есть!"
    "Все рисунки выполнены в жанре постапокалипсиса, где всё грязное, заброшенное, в тёмных тонах. Как раз то, что нужно."
    "Теперь нужно подключить все эти текстурки в игру, используя инструмент в движке {bt=6}{color=#1cd3a2}Tilemap{/color}{/bt}, привязать к объекту персонажа, к другим объектам."
    "Подключение текстур{cps=2}...{/cps}"
    "Всё это делается довольно быстро, и вот ты уже закончил со спрайтами. Ты уже хотел было отдохнуть, но тут..."
    jump big_scene_2

label violet_scene_2:
    maincharacter "Без паники! у меня уже почти всё готово! Нужны лишь уровни... Не будет мне никакого отдыха в эти 2 дня! За работу!!"
    "Ты начинаешь придумывать уровни, без сюжета, ведь на это просто нет времени."
    "За этот день ты спланировал всего 5 остроумных уровней, которые используют все механики, осталось только их реализовать."
    "Эту ночь ты практически не спишь... До четырёх часов ночи ты программируешь и попутно исправляешь придуманные в спешке уровни, и у тебя..."
    "...Получилось! Ты сделал это! Ты засыпаешь прямо на столе перед ноутбуком."
    jump end_day_3