label violet_scene_1:
    "Поиск{cps=2}...{/cps}"
    "Отлично! Пару десятков минут поиска в открытых источниках и подходящие спрайты есть!"
    "Все рисунки выполнены в жанре постапокалипсиса, где всё грязное, заброшенное, в тёмных тонах. Как раз то, что нужно."
    "Теперь нужно подключить все эти текстурки в игру, используя инструмент в движке {bt=6}{color=#1cd3a2}Tilemap{/color}{/bt}, привязать к объекту персонажа, к другим объектам."
    "Подключение текстур{cps=2}...{/cps}"
    "Всё это делается довольно быстро, и вот ты уже закончил со спрайтами. Ты уже хотел было отдохнуть, но тут..."
    jump big_scene_2

label violet_scene_2:
    maincharacter "Без паники! у меня уже почти всё готово! Нужны лишь уровни... Не будет мне никакого отдыха в эти 2 дня! За работу!!"
    "Ты начинаешь придумывать уровни, без сюжета, ведь на это просто нет времени."
    "За этот день ты спланировал всего 5 остроумных уровней, которые используют все механики, осталось только их реализовать."
    "Эту ночь ты практически не спишь... До четырёх часов ночи ты программируешь и попутно исправляешь придуманные в спешке уровни, и у тебя..."
    "...Получилось! Ты сделал это! Ты засыпаешь прямо на столе перед ноутбуком."
    jump end_day_3

label violet_scene_3:
    maincharacter "Я работаю над платформером, но некоторые вещи всё еще не успел реализовать."
    maincharacter "Если честно, мне бы очень пригодилась помощь с финальными доработками — багами и оптимизацией."
    show pavel calm1:
        xalign 0.8
        yalign 1.05
    "Ты даёшь ему сыграть в твой прототип игры."
    show gg calm1:
        xalign 0.2
        yalign 1.05
    pavel "Хм, ну, выглядит неплохо, давай проверим механики..."
    pavel "Ага! Если слишком часто переключаться между измерениями, то некоторые объекты в игре ломаются. Сейчас исправим!"

    "Он молниеносно находит эту механику в коде и исправляет её, а ты даже не успеваешь уследить за его действиями"
    jump big_scene_4


label violet_scene_END_IS_NEAR:
    show boss hands_:
        xalign 0.3
        yalign 1.05

    boss "Итак, [gg_name]. Я ждал вас."
    boss "Не будем тянуть. Начнём."

    "Твоя ладонь крепче сжимает флешку, и ты быстро подходишь к компьютеру, подключаешь её к порту." 
    "Ты включаешь игру, и на экране появляется главное меню — результат дней и ночей работы, испытание для твоих навыков и терпения."
    "Открывается первый уровень, и ты слышишь..."

    boss "Прошу, сначала расскажите про вашу игру. Что она из себя представляет?"

    show gg calm2:
        xalign 0.8
        yalign 1.05
        
    maincharacter "Пиксельный платформер. Весь дизайн, как вы видите, выполнен в жанре постапокалипсиса в тёмных тонах."
    maincharacter "В игре имеются такие механики, как двойной прыжок, прыжки от стен и самое главное: переключение между мирами, чтобы определённые объекты существовали лишь в определённом мире."
   
    maincharacter "Таким образом, платформер сочетает в себе элементы головоломки. Игроку нужно придумать способ взаимодействия с объектами в разных мирах, чтобы пройти дальше. Также присутствуют враги. В платформере несколько хороших уровней, отлично демонстрирующих каждую из механик."
    show boss speak_:
        xalign 0.3
        yalign 1.05
    boss "Звучит очень даже многообещающе. Посмотрим, как ты всё это реализовал."
    boss "Ещё вопрос, что делает твою игру особенной?"

    show gg calm1:
        xalign 0.8
        yalign 1.05

    maincharacter "Довольно уникальные механики, конечно! А также спрятанные на уровнях секретные бонусы, которые игрок получит, если будет тщательно исследовать уровни."
    
    show boss calm:
        xalign 0.3
        yalign 1.05
    boss "Да, механики действительно интересные. Я бы сказал даже полный набор, чтобы сделать хороший полноценный платформер, если развить идею и придумать сюжет."

    "Босс что-то записывает себе в блокнот. На его лице видна ухмылка."
    
    show boss hands_:
        xalign 0.3
        yalign 1.05
    boss "Хорошо, продолжим. Покажи, как ты проходишь этот уровень."

    "В первом уровне доступны лишь двойной прыжок и прыжки от стен, ты показываешься секретку в уровне и проходишь его."

    boss "Мгм, спрайты игры взяты из интернета, такое я уже видел..."

    "Босс снова записывает в блокнот"

    boss "Что этот уровень из себя представляет? Что он показывает игроку?"
    
    show gg speak_:
        xalign 0.8
        yalign 1.05
    maincharacter "Он знакомит игрока с управлением и демонстрирует базовые механики - двойной прыжок и прыжки от стен."

    maincharacter "Это всё что нужно, чтобы пройти уровень. Также  если игрок будет достаточно любознательным, то он с лёгкостью поймёт, что на уровнях присутствуют секретки, которые дают персонажу различные бонусы, такие как усиление прыжка."

    boss "С этим разобрались, а теперь..."
    boss "Позволь мне пройти следующие уровни."
    
    show gg calm1:
        xalign 0.8
        yalign 1.05
    maincharacter "Да, конечно... прошу."

    show boss calm:
        xalign 0.3
        yalign 1.05
    "Ты передаешь клавиатуру и мышь Боссу"

    "Он не спеша проходит второй уровень, в котором уже присутствуют враги, как в Марио, но еще нет механики переключения миров. Он прыгает в различные стороны и задевает все стены."
    "Вдруг персонаж игры вылетает за пределы уровня. Перезапуск. Босс не реагирует, перепроходит уровень. Третий уровень демонстрирует все доступные механики."
    "Босс пытается умереть от лёгких врагов, но безуспешно. Кажется, главный герой не получает от них урона. Снова никакой реакции. Босс находит секретную комнату и проходит уровень. Игра пройдена."
    "Босс снова записывает что-то в свой блокнот с каменным лицом"
   
    show boss hands_:
        xalign 0.3
        yalign 1.05
    boss "Мгм."
    "Он снова записывает что-то в блокнот"
    boss "Баги. Расскажи, как ты с ними справлялся?"

    show gg calm2:
        xalign 0.8
        yalign 1.05
    maincharacter "Когда я сделал первую версию игры, у меня было довольно много багов, таких как неработающие платформы, сломанная физика. Критические баги мне помог пофиксить ваш сотрудник, Павел."
    maincharacter "Некоторую часть я исправил после встречи с ним, после того, как я научился правильно находить и фиксить баги. Часть багов также отпала, когда я делал рефакторинг кода. На исправление оставшихся багов просто не хватило времени..."

    show boss speak_:
        xalign 0.3
        yalign 1.05
    boss "Оу, так ты уже и с сотрудниками познакомился? И даже поработать с ними успел? Это, несомненно, большой плюс."

    show gg calm1:
        xalign 0.8
        yalign 1.05
    maincharacter "Да, ваши сотрудники довольно отзывчивы, и не только Павел. Они мне помогли в разработке игры."

    show boss calm:
        xalign 0.3
        yalign 1.05
    boss "Да, именно таких мы и берём в нашу команду."

    maincharacter "А теперь скажи-ка мне честно, мы дали тебе на разработку игры полгода, сколько из этого времени вы потратили на свою игру, что тебе не хватило времени, чтобы исправить баги?"
    menu:
        "4 Дня. (сказать правду)":
            jump pink_end
        "Ну... где-то месяц (солгать)":
            jump violet_end

label pink_end:
    show gg calm2:
        xalign 0.8
        yalign 1.05
    maincharacter "Я начал разработку 4 дня назад, когда пришло ваше письмо... Я так увлёкся видеоиграми и развлечениями, что забыл о дедлайне..."

    show boss speak_:
        xalign 0.3
        yalign 1.05
    boss "То есть ты хочешь сказать, что ты создал ЭТУ игру за 4 дня?!"
    boss "Красивый платформер с кучей классных реализованных механик?!"
    boss "Тут даже уровни, которые, кстати, довольно разнообразны, идут последовательно, каждый раз давая игроку новые механики!"

    maincharacter "-Ну... Получается так."
    
    "Он проверяет дату изменения файлов и убеждается, что ты говоришь правду"

    show boss hands_:
        xalign 0.3
        yalign 1.05
    boss "Это было глупо с твоей стороны так относиться к дедлайну. Если ты смог сделать ТАКОЕ за 4 дня, то представь, что бы ты мог сделать, потратив на игру гораздо больше времени."
    boss "Это просто невероятно, [gg_name]! Теперь я вовсе не виню тебя за то, что ты взял готовые спрайты из интернета, это было лучшее решение, чтобы больше времени потратить на разработку."
    boss "Так это всё ещё и очень хорошо смотрится в твоей игре!"
    boss "Что касается багов..."
    boss "Это совершенно нормально! Всего 4 дня разработки, полного отсутствия багов невозможно добиться в такой короткий срок, это полностью оправдано."
    boss "Уверен, будь у тебя больше времени, ты бы несомненно справился, ведь так?"

    show gg calm1:
        xalign 0.8
        yalign 1.05
    maincharacter "Так точно, сэр!"

    boss "Я и не сомневался."
    boss "Я готов сделать вердикт."

    maincharacter "Правда? Вот так сразу?"

    boss "Конечно, зачем тянуть?"

    maincharacter "Я вас слушаю..."

    "Твоё сердце начинает биться сильнее и сильнее, как будто оно сейчас вырвется из твоей груди и побежит делать платформер, где нужно прыгать, когда стучит сердце. Прыгать придётся очень часто."

    boss "Несмотря на то, что вы безответственно отнеслись к дедлайну, и потратили всего четыре дня из шести месяцев..."
    boss "Вы сумели сделать отличную игру в такой короткий срок!"
    boss "Я готов принять вас к себе полноценным разработчиком в нашу Компанию!"
    boss "Ну, [gg_name], что скажете?"

    show gg shock_:
        xalign 0.8
        yalign 1.05
    maincharacter "Да! Да, чёрт возьми!"
    maincharacter "Попасть к вам - вот моя мечта. И она сбывается. Спасибо вам, я вас не подведу!"
    
    boss "Добро пожаловать в команду!"
    jump pink_epilog

label pink_epilog:
    scene bg yay with fade
    "И вот ты официально стал частью команды, и теперь ты работаешь вместе с теми, кто тебе помогал и продолжает помогать до сих пор."
    "Сева, Павел, Настя, Костян - все рады видеть тебя в дружном коллективе."
    "Вам сразу был назначен проект - соревновательная 2D-игра для четырёх игроков с элементами платформера. Ты легко реализуешь все те механики, которые вы вместе продумали."
    "Вы обсуждаете код, исправляете баги, придумываете что-то новое, проектируете."
    "Ты явно добиваешься успеха в этой команде, поэтому Босс радует тебя частыми премиями."
    "Твоя мечта сбылась - ты наконец становишься разработчиком видеоигр в одной из лучших компаний в окружении людей, которые всегда готовы помочь."
    "И вот так заканчивается, или же только начинается история одного амбициозного разработчика видеоигр..."
    jump credits


label violet_end:
    show gg calm2:
        xalign 0.8
        yalign 1.05
    maincharacter "Ну... На разработку ушло где-то месяц, вроде."

    show boss speak_:
        xalign 0.3
        yalign 1.05
    boss "Ты целый месяц разрабатывал эту игру, и ты не удосужился пофиксить самый очевидный баг? Я про тот, где игрок не получает урона от врагов."

    maincharacter "Но я..."

    boss "Что ты? Тебе нужно было больше времени?"
    boss "У тебя было полгода! Нужно было уделять больше времени для своей игры!"
    boss "Ты еще и ассеты из интернета взял..."
    boss "Так ты ещё и некоторые баги не исправил!"

    "Ты очень сильно облажался, когда соврал про время разработки." 
    "Теперь он зол, и перечисляет все недостатки твоей игры. Тебе так стыдно, что ты уже просто не можешь сказать правду, потому что Босс уже не поверит."
  
    show boss hands_:
        xalign 0.3
        yalign 1.05
    boss "Но в целом... Платформер очень даже достойный. Интересная задумка с разными мирами и геймплей я бы даже сказал хороший."
    boss "И да, дизайн игры, украденный тобой из интернета, действительно смотрится органично с твоим геймплеем."
    boss "Слушай, [gg_name], я вижу в тебе потенциал, просто..."
    boss "Это задание было дано, чтобы проверить тебя, и я узнал о тебе всё, что нужно."
    boss "Я готов сделать вердикт."

    show gg calm1:
        xalign 0.8
        yalign 1.05
    maincharacter "Правда? Вот так сразу?"

    boss "Конечно, зачем тянуть?"

    maincharacter "Я вас слушаю..."

    "Твоё сердце начинает биться сильнее и сильнее, как будто оно сейчас вырвется из твоей груди и побежит делать платформер, где нужно прыгать, когда стучит сердце. Прыгать придётся очень часто."

    boss "Учитывая, что вы безответственно отнеслись к дедлайну, и потратили всего месяц, при этом сделав финальный продукт, не протестировав его..."
    boss "Также учитывая, что задумка игры вполне неплохая, и сам по себе платформер хороший."
    boss "В общем..."
    boss "Я вижу вы очень способны, поэтому я готов принять вас на испытательный срок в 1 месяц, а дальше уже посмотрим, брать вас или нет."
    boss "Ну, [gg_name], что скажете?"
    
    show gg shock_:
        xalign 0.8
        yalign 1.05
    maincharacter "Да! Да, чёрт возьми!"
    maincharacter "Попасть к вам - вот моя мечта. И она сбывается. Спасибо вам, я вас не подведу!"

    boss "Добро пожаловать в команду!"
    jump violet_epilog

label violet_epilog:
    scene bg yay with fade
    "И вот ты официально стал частью команды, и теперь ты работаешь вместе с теми, кто тебе помогал и продолжает помогать до сих пор."
    "Сева, Павел, Настя, Костян - все рады видеть тебя в дружном коллективе."
    "Вам сразу был назначен проект - соревновательная 2D-игра для четырёх игроков с элементами платформера."
    "Ты легко реализуешь все те механики, которые вы вместе продумали. Вы обсуждаете код, исправляете баги, придумываете что-то новое, проектируете."
    "Ты явно добиваешься успеха в этой команде, поэтому Босс устраивает тебя полноценным разработчиком спустя 15 дней после начала испытательного срока."
    "Твоя мечта сбылась - ты наконец становишься разработчиком видеоигр в одной из лучших компаний"
    "И вот так заканчивается, или же только начинается история одного амбициозного разработчика видеоигр..."
    jump credits