label yellow_scene_1:


    "Очередной день. Кажется, ты уже начинаешь уставать. Но не время унывать!"
    "Игра уже считай готова, нужны лишь пара механик, случайные события, спрайты."
    "И вот ты решил сделать себе небольшой отдых, вкусно пообедать, и тут..."
    jump big_scene_2

label yellow_scene_2:
    
    maincharacter "Без паники! у меня уже почти всё готово! Нужны лишь пара механик и спрайтов..."
    maincharacter "Не будет мне никакого отдыха в эти 2 дня!"
    maincharacter "За работу!!"
    maincharacter "Найду модельки в интернете, чёрт с ними!"

    "Отлично! Примерно час поиска в открытых источниках и подходящие модели есть!"
    "Ты подобрал те самые спрайты, которые хотел - инопланетные посетители, кафе, космос."
    "Ты начинаешь программировать механику обслуживания, случайные события, улучшения, приготовление блюд. Всё это без сюжета, ведь на это просто нет времени."
    "Эту ночь ты практически не спишь... До четырёх часов ночи ты программируешь и попутно исправляешь придуманные механики, и у тебя..."
    "...Получилось! Ты сделал это! Ты засыпаешь прямо на столе перед ноутбуком."
    jump end_day_3

label yellow_scene_4:
    maincharacter "Я работаю над казуалкой, где нужно управлять кафешкой, но некоторые вещи всё еще не успел реализовать."
    maincharacter "Если честно, мне бы очень пригодилась помощь с финальными доработками — багами и оптимизацией."

    "Ты даёшь ему сыграть в твой прототип игры."

    pavel "Хм, ну, выглядит неплохо, давай проверим механики..."
    pavel "Ага! Если слишком часто нажимать на потребность клиента, то всё ломается. Сейчас исправим!"

    "Он молниеносно находит эту механику в коде и исправляет её, а ты даже не успеваешь уследить за его действиями"
    jump big_scene_4